app/controllers/assignments_controller.rb

def export_csv

	book = Spreadsheet::Workbook.new
	sheet1 = book.create_worksheet
	sheet1.name = 'Tickets'
	find_options = { :sorting => active_scaffold_config.list.user.sorting }

	params[:search] = session[:search]

	do_search rescue nil
	params[:segment_id] = session[:segment_id]
	do_segment_search rescue nil
	find_options.merge!({
          :per_page => active_scaffold_config.list.user.per_page,
          :page => active_scaffold_config.list.user.page
        })
	records = find_page(find_options).items
#records = find_page().items

    #return if records.size == 0

    # Note this code is very generic.  We could move this method and the
    # action_link configuration into the ApplicationController and reuse it
    # for all our models.
    #data = []
    cls = records[0].class
    #data << cls.csv_header
	sheet1.row(0).push 'Ticket','Ticket Type','Status','Owner','Create Date','Assign Date','Close Date','Business Days Spent'
	sheet1.row(0).height = 20
	sheet1.column(0).width = 10
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `tickets` WHERE (`tickets`.assignment_id = 16) LIMIT 1

	def stat
		@threedays_title = "Three Days' Tickets"
		@fivedays_title = "Five Days' Tickets"
		@Sevendays_title = "Seven Days' Tickets"
		@tendays_title = "Ten Days' Tickets"
		@this_month_title = "This Month's Tickets"
		@this_year_unsolved_title = "This Year's Tickets"
		@this_month_solved_title = "This Month's Tickets"
		@this_year_title = "This Year's Tickets"

		@threedays_sql = ['assignments.assign_date >= ? AND assignments.assign_date <= ? AND assignments.status in (?)', 3.days.ago,Date.today,["hold"]]
		@fivedays_sql = ['assignments.assign_date >= ? AND assignments.assign_date < ? AND assignments.status in (?)', 5.days.ago,3.days.ago,["hold"]]
		@sevendays_sql = ['assignments.assign_date >= ? AND assignments.assign_date < ? AND assignments.status in (?)', 7.days.ago,5.days.ago,["hold"]]
		@tendays_sql = ['assignments.assign_date >= ? AND assignments.assign_date < ? AND assignments.status in (?)', 10.days.ago,7.days.ago,["hold"]]
		@this_month_sql = ['assignments.assign_date >= ? AND assignments.assign_date <= ? AND assignments.status in (?)', Date.today.at_beginning_of_month,Date.today.at_end_of_month,["hold"]]
		@this_year_unsolved_sql = ['assignments.assign_date >= ? AND assignments.assign_date <= ? AND assignments.status in (?)', Date.today.at_beginning_of_year,Date.today.at_end_of_year,["hold"]]

		@this_month_solved_sql = ['assignments.assign_date >= ? AND assignments.assign_date <= ? AND assignments.status in (?)', Date.today.at_beginning_of_month,Date.today.at_end_of_month,["closed"]]

		@this_year_sql = ['assignments.assign_date >= ? AND assignments.assign_date <= ? AND assignments.status in (?)', Date.today.at_beginning_of_year,Date.today.at_end_of_year,["closed"]]

		@treedays = Assignment.count(:conditions => @threedays_sql   )
---
SELECT count(*) AS count_all FROM `assignments` WHERE (assignments.assign_date >= '2011-10-15 14:35:34' AND assignments.assign_date < '2011-10-17 14:35:34' AND assignments.status in ('assigned','hold'))