app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.person_id = 1) LIMIT 1
---
  def new
    @user = User.new
	@person = Person.find(:all,:joins=> "LEFT JOIN users ON users.person_id = people.id",:conditions => "users.person_id IS NULL")

INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `person_id`, `email`, `created_at`) VALUES('', '308fa2668861c22f982420350a497435abc7b500', '2011-10-21 10:29:21', 'da90f351e3fe10bbc60843ca6bb8304e617b67fe', NULL, NULL, 'simon', 4, 'jfsois@china.com', '2011-10-21 10:29:21')
---
  def create
    logout_keeping_session!
	#@person = Person.find(params[:user][:person_id])
	@person_id = params[:user][:person_id]
	params[:user].delete(:person_id)
    @user = User.new(params[:user])
	#logger.debug "params[:user]: #{params[:user]}"
	#@user.person << @person#@person.user << @user
	@user.person_id = 	@person_id
    success = @user && @user.save